      *meu primeiro programa em COBOL
       IDENTIFICATION DIVISION.
      *inclusão de iformacoes documentais
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
      *descreve o computador onde o programa esta sendo escrito
       DATA DIVISION.
      *ARQUIVOS DE ENTRADA E SAIDA, VARIAVEIS E CNSTANTES
       PROCEDURE DIVISION.
      *Contem o codiogo que ira manipular os dados e incluir o algoriti-
      *mo do programa
           DISPLAY "HELLO WORD".
           STOP RUN.
